"""
    复习
        数据的基本运算
            数据
                变量：操作数据
                    名称 = 数据
                del:删除变量
                    引用计数:数据存储着被变量关联的数量
                            如果数据为0,则销毁.
                类型
                    None:占位,解除与变量的关联关系
                    int:整数
                    float:小数
                    str:文字
                    bool:命题   True真  False假
                转换
                    类型(待转类型)
            运算
                算数:+-* / //  % **
                增强:+=  -=  *=  /= //=  %=  **=
                    a =  a + 10
                    a  += 10 # 累加(运算后又赋值给变量)
                比较：==   !=
                逻辑:and  都得满足，结果才成立
                    or   满足一个，结果就成立
                    not 反
"""





