"""
    复习
        语句
            选择：根据条件选择性的执行
                if
                else
            循环：根据条件/次数重复的执行
                while
                for 变量名 in range(开始,结束,间隔)
            跳转：跳转到其他逻辑
                跳出：break
                跳过：continue
        容器
            通用操作：
                算数运算符 +  *   ==  !=
                成员  in     not in
                索引  定位当个元素
                切片     多个

            字符串：存储字符编码值,不可变,序列
            列表：存储变量,可变,序列
                常用操作
                    创建([]/list())、添加(插/追)、
                    删除(元素/位置)、修改(位置)
                    查询(位置/循环)
"""
list01 = ["悟空","八戒"]










